[
   [
      "Getopt::EX::Hashed - Hash object automation for Getopt::Long\n",
      "Getopt::EX::Hashed - Getopt::Long 的哈希对象自动化\n"
   ],
   [
      "B<Getopt::EX::Hashed> is a module to automate the creation of a hash object to store command line option values for B<Getopt::Long> and compatible modules including B<Getopt::EX::Long>. The module name shares the B<Getopt::EX> prefix, but it works independently from other modules in B<Getopt::EX>, so far.\n",
      "B<Getopt::EX::Hashed> 是一个自动创建哈希对象的模块，用于存储 B<Getopt::Long> 和兼容模块（包括 B<Getopt::EX::Long>）的命令行选项值。模块名称共享 B<Getopt::EX> 前缀，但到目前为止，它独立于 B<Getopt::EX> 中的其他模块运行。\n"
   ],
   [
      "The major objective of this module is integrating initialization and specification into a single place. It also provides a simple validation interface.\n",
      "该模块的主要目标是将初始化和规范整合到一个地方。它还提供了一个简单的验证接口。\n"
   ],
   [
      "Accessor methods are automatically generated when C<is> parameter is given. If the same function is already defined, the program causes fatal error. Accessors are removed when the object is destroyed. Problems may occur when multiple objects are present at the same time.\n",
      "当给出 C<is> 参数时，将自动生成访问方法。如果已经定义了相同的函数，程序将导致致命错误。对象销毁时，访问器将被移除。当多个对象同时存在时，可能会出现问题。\n"
   ],
   [
      "Declare option parameters in the following form. The parentheses are for clarity only and may be omitted.\n",
      "以下列形式声明选项参数。括号仅为清晰起见，可以省略。\n"
   ],
   [
      "For example, to define the option C<--number>, which takes an integer value as a parameter, and also can be used as C<-n>, do the following\n",
      "例如，要定义以整数值为参数的选项 C<--number>（也可用作 C<-n>），请执行以下操作\n"
   ],
   [
      "The accessor is created with the first name. In this example, the accessor will be defined as C<< $app->number >>.\n",
      "访问器以第一个名称创建。在本例中，访问器将定义为 C<< $app->number >>。\n"
   ],
   [
      "If an array reference is given, multiple names can be declared at once.\n",
      "如果给出的是数组引用，可以同时声明多个名称。\n"
   ],
   [
      "If the name starts with plus (C<+>), the given parameter updates the existing setting.\n",
      "如果名称以加号（C<+>）开头，则所给参数将更新现有设置。\n"
   ],
   [
      "As for the C<spec> parameter, the label can be omitted if it is the first parameter.\n",
      "至于 C<spec> 参数，如果它是第一个参数，则可以省略标签。\n"
   ],
   [
      "If the number of parameters is odd, the first parameter is treated as having an implicit label: C<action> if it is a code reference, C<spec> otherwise.\n",
      "如果参数个数为奇数，第一个参数将被视为隐式标签：如果是代码引用，则为 C<action>，否则为 C<spec>。\n"
   ],
   [
      "Following parameters are available.\n",
      "可使用以下参数\n"
   ],
   [
      "Give option specification. C<< spec => >> label can be omitted if and only if it is the first parameter.\n",
      "给出选项说明。C<< spec => >> 标签可以省略，前提是它是第一个参数。\n"
   ],
   [
      "In I<string>, option spec and alias names are separated by white space, and can show up in any order.\n",
      "在 I<string> 中，选项规格和别名用空白分隔，可以任意顺序出现。\n"
   ],
   [
      "To have an option called C<--start> that takes an integer as its value and can also be used with the names C<-s> and C<--begin>, declare as follows.\n",
      "如果要使用一个名为 C<--start> 的选项，它的值是一个整数，并且还可以与 C<-s> 和 C<--begin> 一起使用，请声明如下。\n"
   ],
   [
      "The above declaration will be compiled into the following string.\n",
      "上述声明将被编译成以下字符串。\n"
   ],
   [
      "which conforms to the C<Getopt::Long> definition. Of course, you can write it as:\n",
      "符合 C<Getopt::Long> 的定义。当然，也可以写成\n"
   ],
   [
      "If the name and aliases contain underscore (C<_>), another alias name is defined with dash (C<->) in place of underscores.\n",
      "如果名称和别名中包含下划线 (C<_>)，则会用破折号 (C<->) 代替下划线定义另一个别名。\n"
   ],
   [
      "If no option spec is needed, give an empty (or white space only) string as a value. Without a spec string, the member will not be treated as an option.\n",
      "如果不需要选项规格，则给出一个空（或仅空白）字符串作为值。如果没有规格字符串，该成员将不会被视为选项。\n"
   ],
   [
      "Additional alias names can be specified by the B<alias> parameter too. There is no difference from the ones in the C<spec> parameter.\n",
      "也可以通过 B<alias> 参数指定其他别名。这与 C<spec> 参数中的别名没有区别。\n"
   ],
   [
      "To produce an accessor method, the C<is> parameter is necessary. Set the value C<ro> for read-only, C<rw> for read-write.\n",
      "要生成访问方法，必须使用 C<is> 参数。设置 C<ro> 表示只读，C<rw> 表示读写。\n"
   ],
   [
      "Read-write accessor has lvalue attribute, so it can be assigned to. You can use like this:\n",
      "读写访问器具有 lvalue 属性，因此可以对其赋值。可以这样使用\n"
   ],
   [
      "This is much simpler than writing as in the following.\n",
      "这比下面的写法要简单得多。\n"
   ],
   [
      "If you want to make accessors for all following members, use C<configure> to set the C<DEFAULT> parameter.\n",
      "如果要为以下所有成员创建访问器，请使用 C<configure> 设置 C<DEFAULT> 参数。\n"
   ],
   [
      "If you don't like assignable accessors, configure the C<ACCESSOR_LVALUE> parameter to 0. Because accessors are generated at the time of C<new>, this value is effective for all members.\n",
      "如果不喜欢可分配访问器，可将 C<ACCESSOR_LVALUE> 参数设置为 0。 因为访问器是在 C<new> 时生成的，所以该值对所有成员都有效。\n"
   ],
   [
      "Set default value. If no default is given, the member is initialized as C<undef>.\n",
      "设置默认值。如果没有给出缺省值，则成员初始化为 C<undef>。\n"
   ],
   [
      "If the value is a reference to an ARRAY or HASH, a shallow copy is created for each C<new> call. This means the reference itself is copied, but the contents are shared. Modifying the array or hash contents will affect all instances.\n",
      "如果值是对 ARRAY 或 HASH 的引用，则每次调用 C<new> 都会创建一个浅层副本。这意味着引用本身被复制，但内容是共享的。修改数组或 HASH 内容将影响所有实例。\n"
   ],
   [
      "If a code reference is given, it is called at the time of B<new> to get default value. This is effective when you want to evaluate the value at the time of execution, rather than declaration. If you want to define a default action, use the B<action> parameter. If you want to set code reference as the initial value, you must specify a code reference that returns a code reference.\n",
      "如果给定了代码引用，则会在调用 B<new> 时调用它以获取默认值。当您想在执行时而不是在声明时评估值时，这种方法非常有效。如果要定义默认操作，请使用 B<action> 参数。如果要将代码引用设置为初始值，则必须指定一个返回代码引用的代码引用。\n"
   ],
   [
      "If a reference to SCALAR is given, the option value is stored in the data indicated by the reference, not in the hash object member. In this case, the expected value cannot be obtained by accessing the hash member.\n",
      "如果给出 SCALAR 的引用，则选项值将存储在引用所指示的数据中，而不是哈希对象成员中。在这种情况下，无法通过访问哈希对象成员获得预期值。\n"
   ],
   [
      "Parameter C<action> takes code reference which is called to process the option. C<< action => >> label can be omitted if and only if it is the first parameter.\n",
      "参数 C<action> 带有处理选项时调用的代码引用。如果 C<<action => >> 标签是第一个参数，则可以省略。\n"
   ],
   [
      "When called, hash object is passed as C<$_>.\n",
      "调用时，哈希对象作为 C<$_> 传递。\n"
   ],
   [
      "You can use this for C<< \"<>\" >> to handle non-option arguments. In that case, the spec parameter does not matter and is not required.\n",
      "您可以将此用于 C<< \"<>\">> 来处理非选项参数。在这种情况下，规格参数并不重要，也不是必需的。\n"
   ],
   [
      "Following parameters are all for data validation. First, C<must> is a generic validator and can implement anything. Others are shortcuts for common rules.\n",
      "以下参数均用于数据验证。首先，C<must> 是一个通用验证器，可以实现任何功能。其他参数是常用规则的快捷方式。\n"
   ],
   [
      "Parameter C<must> takes a code reference to validate option values. It takes the same arguments as C<action> and returns a boolean. With the following example, option B<--answer> takes only 42 as a valid value.\n",
      "参数 C<must> 需要一个代码引用来验证选项值。它接收与 C<action> 相同的参数，并返回一个布尔值。在下面的示例中，选项 B<--answer> 只接受 42 作为有效值。\n"
   ],
   [
      "If multiple code references are given, all code must return true.\n",
      "如果给出多个代码引用，则所有代码都必须返回 true。\n"
   ],
   [
      "Set the minimum and maximum limit for the argument.\n",
      "设置参数的最小和最大限制。\n"
   ],
   [
      "Set the valid string parameter list. Each item can be a string, a regex reference, or a code reference. The argument is valid when it is the same as, or matches any item of the given list. If the value is not an arrayref, it is taken as a single item list (regexpref or coderef usually).\n",
      "设置有效字符串参数列表。每个项目可以是字符串、regex 引用或代码引用。当参数与给定列表中的任何一项相同或匹配时，该参数即为有效参数。如果参数值不是数组反射，则会被视为单项列表（通常是 regexpref 或 coderef）。\n"
   ],
   [
      "Following declarations are almost equivalent, except second one is case insensitive.\n",
      "以下声明几乎等同，只是第二个声明不区分大小写。\n"
   ],
   [
      "If you are using optional argument, don't forget to include default value in the list. Otherwise it causes validation error.\n",
      "如果使用可选参数，不要忘记在列表中包含默认值。否则会导致验证错误。\n"
   ],
   [
      "A class method that creates a new hash object. Initializes all members with their default values and creates accessor methods as configured. Returns a blessed hash reference. The hash keys are locked if LOCK_KEYS is enabled.\n",
      "创建新散列对象的类方法。使用默认值初始化所有成员，并根据配置创建访问方法。返回一个受祝福的哈希引用。如果启用了 LOCK_KEYS，哈希键将被锁定。\n"
   ],
   [
      "Returns the option specification list which can be passed to the C<GetOptions> function.\n",
      "返回可传递给 C<GetOptions> 函数的选项规范列表。\n"
   ],
   [
      "C<GetOptions> has the capability of storing values in a hash by giving the hash reference as the first argument, but it is not necessary.\n",
      "C<GetOptions> 可以通过将哈希引用作为第一个参数在哈希中存储值，但这并非必要。\n"
   ],
   [
      "Calls the appropriate function defined in the caller's context to process options.\n",
      "调用调用者上下文中定义的适当函数来处理选项。\n"
   ],
   [
      "The above examples are shortcuts for the following code.\n",
      "以上示例是以下代码的快捷方式。\n"
   ],
   [
      "When LOCK_KEYS is enabled, accessing a non-existent member causes an error. Use this method to declare new member keys before accessing them.\n",
      "启用 LOCK_KEYS 后，访问不存在的成员会导致错误。在访问新成员键之前，请使用此方法声明新成员键。\n"
   ],
   [
      "If you want to access arbitrary keys, unlock the object.\n",
      "如果要访问任意键，请解锁对象。\n"
   ],
   [
      "You can change this behavior by C<configure> with C<LOCK_KEYS> parameter.\n",
      "您可以通过带有 C<LOCK_KEYS> 参数的 C<configure> 改变这种行为。\n"
   ],
   [
      "Use class method C<< Getopt::EX::Hashed->configure() >> before creating an object; this information is stored separately for each calling package. After calling C<new()>, the package-level configuration is copied into the object for its use. Use C<< $obj->configure() >> to update object-level configuration.\n",
      "在创建对象之前，请使用类方法 C<< Getopt::EX::Hashed->configure() >>；每个调用包都会单独存储此信息。调用 C<new()> 后，软件包级配置将复制到对象中供其使用。使用 C<< $obj->configure() >> 更新对象级配置。\n"
   ],
   [
      "The following configuration parameters are available.\n",
      "可使用以下配置参数。\n"
   ],
   [
      "Lock hash keys. This prevents typos or other mistakes from creating unintended hash entries.\n",
      "锁定哈希键。这样可以防止输入错误或其他错误创建意外的哈希条目。\n"
   ],
   [
      "Automatically create option aliases with underscores replaced by dashes.\n",
      "自动创建选项别名，下划线改为破折号。\n"
   ],
   [
      "Automatically create option aliases with underscores removed.\n",
      "自动创建去掉下划线的选项别名。\n"
   ],
   [
      "Set the function name called from the C<getopt> method.\n",
      "设置 C<getopt> 方法调用的函数名。\n"
   ],
   [
      "When specified, it will be prepended to the member name to make the accessor method. If C<ACCESSOR_PREFIX> is defined as C<opt_>, the accessor for member C<file> will be C<opt_file>.\n",
      "指定后，它将作为成员名的前缀，使其成为访问方法。如果 C<ACCESSOR_PREFIX> 被定义为 C<opt_>，成员 C<file> 的访问器将是 C<opt_file>。\n"
   ],
   [
      "If true, read-write accessors have the lvalue attribute. Set to zero if you don't like that behavior.\n",
      "如果为 true，读写访问器将具有 lvalue 属性。如果不喜欢这种行为，请设置为零。\n"
   ],
   [
      "Set default parameters. When C<has> is called, DEFAULT parameters are inserted before the explicit parameters. If a parameter appears in both, the explicit one takes precedence. Incremental calls with C<+> are not affected.\n",
      "设置默认参数。调用 C<has> 时，DEFAULT 参数会插入显式参数之前。如果一个参数同时出现在两个参数中，则显式参数优先。使用 C<+> 的递增调用不受影响。\n"
   ],
   [
      "A typical use of DEFAULT is C<is> to prepare accessor methods for all following hash entries. Declare C<< DEFAULT => [] >> to reset.\n",
      "DEFAULT 的一个典型用法是 C<is> 为下面所有哈希条目准备访问方法。声明 C<< DEFAULT => [] >> 以重置。\n"
   ],
   [
      "Set a code reference to generate error messages for validation failures. The code reference receives the same arguments as the option handler ($_[0] is option name, $_[1] is the value for simple options, or $_[1] and $_[2] for hash options). The default function generates messages like \"--option=value: option validation error\".\n",
      "设置代码引用，以便在验证失败时生成错误信息。代码引用接收与选项处理程序相同的参数（$_[0] 是选项名称，$_[1] 是简单选项的值，或 $_[1] 和 $_[2] 是哈希选项的值）。默认函数会生成类似\"--option=value：选项验证错误 \"的信息。\n"
   ],
   [
      "Reset the class to the original state.\n",
      "将类重置为原始状态。\n"
   ]
]
