[
   [
      "Getopt::EX::Hashed - Hash object automation for Getopt::Long\n",
      "Getopt::EX::Hashed - Getopt::Long のハッシュオブジェクト自動化\n"
   ],
   [
      "B<Getopt::EX::Hashed> is a module to automate the creation of a hash object to store command line option values for B<Getopt::Long> and compatible modules including B<Getopt::EX::Long>. The module name shares the B<Getopt::EX> prefix, but it works independently from other modules in B<Getopt::EX>, so far.\n",
      "B<Getopt::EX::Hashed>は、B<Getopt::Long>およびB<Getopt::EX::Long>を含む互換モジュールのコマンドラインオプション値を格納するハッシュオブジェクトの作成を自動化するモジュールです。モジュール名はB<Getopt::EX>プレフィックスを共有していますが、これまでのところ、B<Getopt::EX>の他のモジュールとは独立して動作します。\n"
   ],
   [
      "The major objective of this module is integrating initialization and specification into a single place. It also provides a simple validation interface.\n",
      "このモジュールの主な目的は、初期化と仕様を一箇所に統合することです。また、簡単な検証インターフェースも提供します。\n"
   ],
   [
      "Accessor methods are automatically generated when C<is> parameter is given. If the same function is already defined, the program causes fatal error. Accessors are removed when the object is destroyed. Problems may occur when multiple objects are present at the same time.\n",
      "C<is>パラメータが与えられると、アクセサメソッドが自動的に生成されます。同じ関数がすでに定義されている場合、プログラムは致命的なエラーを引き起こします。アクセサはオブジェクトが破棄されると削除されます。複数のオブジェクトが同時に存在する場合、問題が発生する可能性があります。\n"
   ],
   [
      "Declare option parameters in the following form. The parentheses are for clarity only and may be omitted.\n",
      "オプション・パラメータを以下の形式で宣言する。括弧はわかりやすくするためのもので、省略してもよい。\n"
   ],
   [
      "For example, to define the option C<--number>, which takes an integer value as a parameter, and also can be used as C<-n>, do the following\n",
      "たとえば、整数値をパラメータとしてとり、C<-n>としても使えるオプションC<--number>を定義するには、次のようにする。\n"
   ],
   [
      "The accessor is created with the first name. In this example, the accessor will be defined as C<< $app->number >>.\n",
      "アクセサは最初の名前で作成されます。この例では、アクセサは C<< $app->number >> と定義されます。\n"
   ],
   [
      "If an array reference is given, multiple names can be declared at once.\n",
      "配列参照が与えられている場合、複数の名前を一度に宣言することができます。\n"
   ],
   [
      "If the name starts with plus (C<+>), the given parameter updates the existing setting.\n",
      "名前がプラス（C<+>）で始まる場合、与えられたパラメータは既存の設定を更新します。\n"
   ],
   [
      "As for the C<spec> parameter, the label can be omitted if it is the first parameter.\n",
      "C<spec>パラメータについては、最初のパラメータであればラベルを省略することができる。\n"
   ],
   [
      "If the number of parameters is odd, the first parameter is treated as having an implicit label: C<action> if it is a code reference, C<spec> otherwise.\n",
      "パラメータの数が奇数の場合、最初のパラメータは暗黙のラベルを持つものとして扱われます：コード参照であれば C<アクション>、そうでなければ C<spec> です。\n"
   ],
   [
      "Following parameters are available.\n",
      "以下のパラメータが利用可能である。\n"
   ],
   [
      "Give option specification. C<< spec => >> label can be omitted if and only if it is the first parameter.\n",
      "オプション指定C<< spec => >> ラベルを省略できるのは、それが最初のパラメータである場合だけである。\n"
   ],
   [
      "In I<string>, option spec and alias names are separated by white space, and can show up in any order.\n",
      "I<string> では、オプションの仕様とエイリアスの名前は空白で区切られ、どのような順番でも表示できます。\n"
   ],
   [
      "To have an option called C<--start> that takes an integer as its value and can also be used with the names C<-s> and C<--begin>, declare as follows.\n",
      "C<--start>というオプションを持ち、その値として整数を取り、C<-s>とC<--begin>という名前でも使えるようにするには、次のように宣言する。\n"
   ],
   [
      "The above declaration will be compiled into the following string.\n",
      "上記の宣言は以下の文字列にコンパイルされる。\n"
   ],
   [
      "which conforms to the C<Getopt::Long> definition. Of course, you can write it as:\n",
      "これは、C<Getopt::Long>の定義に準拠しています。もちろん、次のように書くこともできます：\n"
   ],
   [
      "If the name and aliases contain underscore (C<_>), another alias name is defined with dash (C<->) in place of underscores.\n",
      "名前とエイリアスにアンダースコア(C<_>)が含まれている場合、アンダースコアの代わりにダッシュ(C<->)を使った別のエイリアスが定義されます。\n"
   ],
   [
      "If no option spec is needed, give an empty (or white space only) string as a value. Without a spec string, the member will not be treated as an option.\n",
      "オプション仕様が必要ない場合は、値として空の（または空白のみの）文字列を指定します。spec 文字列がない場合、メンバはオプションとして扱われません。\n"
   ],
   [
      "Additional alias names can be specified by the B<alias> parameter too. There is no difference from the ones in the C<spec> parameter.\n",
      "B<alias>パラメータで追加のエイリアス名を指定することもできます。C<spec>パラメータのものと違いはありません。\n"
   ],
   [
      "To produce an accessor method, the C<is> parameter is necessary. Set the value C<ro> for read-only, C<rw> for read-write.\n",
      "アクセサメソッドを生成するには、C<is>パラメータが必要です。読み込み専用ならC<ro>、読み書きならC<rw>を指定します。\n"
   ],
   [
      "Read-write accessor has lvalue attribute, so it can be assigned to. You can use like this:\n",
      "読み書き可能なアクセサはlvalue属性を持っているので、それを代入することができます。このように使えます：\n"
   ],
   [
      "This is much simpler than writing as in the following.\n",
      "これは、次のように書くよりずっと簡単だ。\n"
   ],
   [
      "If you want to make accessors for all following members, use C<configure> to set the C<DEFAULT> parameter.\n",
      "以下のすべてのメンバに対してアクセサを作りたい場合は、C<configure>を使ってC<DEFAULT>パラメータを設定する。\n"
   ],
   [
      "If you don't like assignable accessors, configure the C<ACCESSOR_LVALUE> parameter to 0. Because accessors are generated at the time of C<new>, this value is effective for all members.\n",
      "割り当て可能なアクセサを好まない場合は、C<ACCESSOR_LVALUE> パラメータを 0 に設定します。アクセサは C<new> の時点で生成されるため、この値はすべてのメンバに対して有効です。\n"
   ],
   [
      "Set default value. If no default is given, the member is initialized as C<undef>.\n",
      "デフォルト値を設定します。デフォルト値が指定されない場合、メンバはC<undef>として初期化されます。\n"
   ],
   [
      "If the value is a reference to an ARRAY or HASH, a shallow copy is created for each C<new> call. This means the reference itself is copied, but the contents are shared. Modifying the array or hash contents will affect all instances.\n",
      "値がARRAYまたはHASHへの参照である場合、C<new>の呼び出しごとに浅いコピーが作成される。これは、参照自体はコピーされるが、内容は共有されることを意味する。配列やハッシュの内容を変更すると、すべてのインスタンスに影響します。\n"
   ],
   [
      "If a code reference is given, it is called at the time of B<new> to get default value. This is effective when you want to evaluate the value at the time of execution, rather than declaration. If you want to define a default action, use the B<action> parameter. If you want to set code reference as the initial value, you must specify a code reference that returns a code reference.\n",
      "コード参照が与えられている場合は、B<new>の時点で呼び出され、デフォルト値が取得されます。宣言ではなく実行時に値を評価したい場合に有効です。デフォルトのアクションを定義したい場合は、B<action>パラメータを使う。コード・リファレンスを初期値にしたい場合は、コード・リファレンスを返すコード・リファレンスを指定する必要があります。\n"
   ],
   [
      "If a reference to SCALAR is given, the option value is stored in the data indicated by the reference, not in the hash object member. In this case, the expected value cannot be obtained by accessing the hash member.\n",
      "SCALARへの参照が与えられた場合、オプション値はハッシュオブジェクトメンバではなく、参照が示すデータに格納されます。この場合、ハッシュ・メンバにアクセスしても期待値は得られません。\n"
   ],
   [
      "Parameter C<action> takes code reference which is called to process the option. C<< action => >> label can be omitted if and only if it is the first parameter.\n",
      "パラメータ C<action> は、オプションを処理するために呼び出されるコード参照をとる。C<<action =>> ラベルは、それが最初のパラメータである場合に限り、省略することができる。\n"
   ],
   [
      "When called, hash object is passed as C<$_>.\n",
      "呼び出されたとき、ハッシュオブジェクトは C<$_> として渡されます。\n"
   ],
   [
      "You can use this for C<< \"<>\" >> to handle non-option arguments. In that case, the spec parameter does not matter and is not required.\n",
      "これを C<< \"<>\" に使うことができる。>> でオプション以外の引数を扱うことができます。その場合、specパラメータは重要ではなく、必須ではありません。\n"
   ],
   [
      "Following parameters are all for data validation. First, C<must> is a generic validator and can implement anything. Others are shortcuts for common rules.\n",
      "以下のパラメータはすべてデータ検証のためのものである。まず、C<must>は汎用的なバリデータであり、何でも実装できます。その他は一般的なルールのショートカットである。\n"
   ],
   [
      "Parameter C<must> takes a code reference to validate option values. It takes the same arguments as C<action> and returns a boolean. With the following example, option B<--answer> takes only 42 as a valid value.\n",
      "パラメータ C<must> は、オプション値を検証するためのコード参照を受け取ります。C<action>と同じ引数をとり、ブール値を返します。次の例では、オプションB<--answer>は有効な値として42だけを取ります。\n"
   ],
   [
      "If multiple code references are given, all code must return true.\n",
      "複数のコード参照が与えられた場合、すべてのコードが真を返さなければなりません。\n"
   ],
   [
      "Set the minimum and maximum limit for the argument.\n",
      "引数の最小値と最大値を設定する。\n"
   ],
   [
      "Set the valid string parameter list. Each item can be a string, a regex reference, or a code reference. The argument is valid when it is the same as, or matches any item of the given list. If the value is not an arrayref, it is taken as a single item list (regexpref or coderef usually).\n",
      "有効な文字列パラメータリストを設定する。各項目は、文字列、正規表現参照、コード参照のいずれかである。引数は、指定されたリストのいずれかの項目と同じか一致する場合に有効である。値がarrayrefでない場合は、単一の項目リスト（通常は正規表現かコード参照）として扱われます。\n"
   ],
   [
      "Following declarations are almost equivalent, except second one is case insensitive.\n",
      "以下の宣言はほぼ等価ですが、2番目の宣言は大文字小文字を区別しません。\n"
   ],
   [
      "If you are using optional argument, don't forget to include default value in the list. Otherwise it causes validation error.\n",
      "オプションの引数を使用する場合は、リストにデフォルト値を含めることを忘れないでください。そうしないとバリデーション・エラーになります。\n"
   ],
   [
      "A class method that creates a new hash object. Initializes all members with their default values and creates accessor methods as configured. Returns a blessed hash reference. The hash keys are locked if LOCK_KEYS is enabled.\n",
      "新しいハッシュオブジェクトを作成するクラスメソッド。すべてのメンバをデフォルト値で初期化し、設定に従ってアクセサ・メソッドを作成します。祝福されたハッシュ参照を返します。LOCK_KEYS が有効な場合、ハッシュ・キーはロックされます。\n"
   ],
   [
      "Returns the option specification list which can be passed to the C<GetOptions> function.\n",
      "C<GetOptions> 関数に渡すことができるオプション指定リストを返します。\n"
   ],
   [
      "C<GetOptions> has the capability of storing values in a hash by giving the hash reference as the first argument, but it is not necessary.\n",
      "C<GetOptions> は、ハッシュ参照を最初の引数として与えることで、ハッシュに値を格納する機能を持っていますが、それは必要ありません。\n"
   ],
   [
      "Calls the appropriate function defined in the caller's context to process options.\n",
      "呼び出し元のコンテキストで定義された適切な関数を呼び出してオプションを処理します。\n"
   ],
   [
      "The above examples are shortcuts for the following code.\n",
      "上記の例は、以下のコードのショートカットです。\n"
   ],
   [
      "When LOCK_KEYS is enabled, accessing a non-existent member causes an error. Use this method to declare new member keys before accessing them.\n",
      "LOCK_KEYS が有効な場合、存在しないメンバにアクセスするとエラーになります。このメソッドを使用して、新しいメンバ・キーを宣言してからアクセスしてください。\n"
   ],
   [
      "If you want to access arbitrary keys, unlock the object.\n",
      "任意のキーにアクセスしたい場合は、オブジェクトのロックを解除してください。\n"
   ],
   [
      "You can change this behavior by C<configure> with C<LOCK_KEYS> parameter.\n",
      "この動作はC<configure>のC<LOCK_KEYS>パラメータで変更できます。\n"
   ],
   [
      "Use class method C<< Getopt::EX::Hashed->configure() >> before creating an object; this information is stored separately for each calling package. After calling C<new()>, the package-level configuration is copied into the object for its use. Use C<< $obj->configure() >> to update object-level configuration.\n",
      "オブジェクトを作成する前に、クラスメソッド C<< Getopt::EX::Hashed->configure() >> を使用します。C<new()> を呼び出すと、パッケージ・レベルの構成がオブジェクトにコピーされ、使用できるようになります。オブジェクト・レベルの設定を更新するには、C<< $obj->configure() >> を使用します。\n"
   ],
   [
      "The following configuration parameters are available.\n",
      "以下の設定パラメータが使用できます。\n"
   ],
   [
      "Lock hash keys. This prevents typos or other mistakes from creating unintended hash entries.\n",
      "ハッシュ・キーをロックします。これにより、タイプミスなどで意図しないハッシュエントリが作成されるのを防ぎます。\n"
   ],
   [
      "Automatically create option aliases with underscores replaced by dashes.\n",
      "アンダースコアをダッシュに置き換えたオプション・エイリアスを自動的に作成します。\n"
   ],
   [
      "Automatically create option aliases with underscores removed.\n",
      "アンダースコアを削除したオプション・エイリアスを自動的に作成する。\n"
   ],
   [
      "Set the function name called from the C<getopt> method.\n",
      "C<getopt> メソッドから呼び出される関数名を設定します。\n"
   ],
   [
      "When specified, it will be prepended to the member name to make the accessor method. If C<ACCESSOR_PREFIX> is defined as C<opt_>, the accessor for member C<file> will be C<opt_file>.\n",
      "指定すると、メンバ名の前に付加されてアクセサ・メソッドになります。C<ACCESSOR_PREFIX> が C<opt_> として定義されている場合、メンバ C<file> のアクセサは C<opt_file> になります。\n"
   ],
   [
      "If true, read-write accessors have the lvalue attribute. Set to zero if you don't like that behavior.\n",
      "trueの場合、読み書きアクセサはlvalue属性を持つ。この動作を好まない場合はゼロに設定します。\n"
   ],
   [
      "Set default parameters. When C<has> is called, DEFAULT parameters are inserted before the explicit parameters. If a parameter appears in both, the explicit one takes precedence. Incremental calls with C<+> are not affected.\n",
      "デフォルトのパラメータを設定する。C<has> が呼び出されると、明示的なパラメータの前に DEFAULT パラメータが挿入されます。パラメータが両方にある場合は、明示的なパラメータが優先される。C<+> によるインクリメンタルコールは影響を受けない。\n"
   ],
   [
      "A typical use of DEFAULT is C<is> to prepare accessor methods for all following hash entries. Declare C<< DEFAULT => [] >> to reset.\n",
      "DEFAULTの典型的な使い方は、C<is>で以下のすべてのハッシュ・エントリーのアクセサ・メソッドを用意することである。C<< DEFAULT => [] >>を宣言してリセットする。\n"
   ],
   [
      "Set a code reference to generate error messages for validation failures. The code reference receives the same arguments as the option handler ($_[0] is option name, $_[1] is the value for simple options, or $_[1] and $_[2] for hash options). The default function generates messages like \"--option=value: option validation error\".\n",
      "検証失敗時のエラーメッセージを生成するコード・リファレンスを設定する。コード・リファレンスは、オプション・ハンドラと同じ引数を受け取ります ($_[0] はオプション名、$_[1] は単純オプションの値、$_[1] と $_[2] はハッシュ・オプションの値です)。デフォルトの関数は、\"--option=value: option validation error\" のようなメッセージを生成する。\n"
   ],
   [
      "Reset the class to the original state.\n",
      "クラスを元の状態にリセットする。\n"
   ]
]
